In [1]:
from sqlalchemy import create_engine
import pandas as pd
import os
from dotenv import load_dotenv
from ydata_profiling import ProfileReport

In [2]:
# Define the host, username, password, and database
# TODO: Use environment variables for these 4 values
host = os.environ.get('HOST')
username = os.environ.get('USERNAME')
password = os.environ.get('PASSWORD')
database = os.environ.get('DATABASE')

# Create a database connection string
ssl_args = {'ssl_ca': '../../../cert/cacert.pem'}
db_connection_str = f'mysql+pymysql://{username}:{password}@{host}/{database}?ssl=true'

# Create a database connection
db_connection = create_engine(db_connection_str, connect_args=ssl_args)

# Execute a SQL query and retrieve the results as a pandas DataFrame
df = pd.read_sql('SELECT * FROM Country', con=db_connection)

# Close the database connection
db_connection.dispose()

In [3]:
# from common_functions import execute_mysql_query

In [4]:
df

       id country_name
0       1      Belgium
1    1729      England
2    4769       France
3    7809      Germany
4   10257        Italy
5   13274  Netherlands
6   15722       Poland
7   17642     Portugal
8   19694     Scotland
9   21518        Spain
10  24558  Switzerland

In [5]:
df.dtypes

id               int64
country_name    object
dtype: object

In [6]:
df.describe()

                 id
count     11.000000
mean   12452.090909
std     8215.308472
min        1.000000
25%     6289.000000
50%    13274.000000
75%    18668.000000
max    24558.000000

In [7]:
simple_profile = df.describe(include='all')
simple_profile

                  id country_name
count      11.000000           11
unique           NaN           11
top              NaN      Belgium
freq             NaN            1
mean    12452.090909          NaN
std      8215.308472          NaN
min         1.000000          NaN
25%      6289.000000          NaN
50%     13274.000000          NaN
75%     18668.000000          NaN
max     24558.000000          NaN

In [8]:
profile = ProfileReport(df, title="Export Data Profiling Report")
profile.to_widgets()

Summarize dataset:   0%|          | 0/5 [00:00<?, ?it/s]

Generate report structure:   0%|          | 0/1 [00:00<?, ?it/s]

Render widgets:   0%|          | 0/1 [00:00<?, ?it/s]

VBox(children=(Tab(children=(Tab(children=(GridBox(children=(VBox(children=(GridspecLayout(children=(HTML(valuâ€¦